const data = {
    "id": Math.random(),
    "title": "***ՆՅԱՐԴԱՀՈԳԵԿԱՆ ԿԱՅՈՒՆՈՒԹՅՈՒՆԸ ԳՆԱՀԱՏՈՂ ՄԵԹՈԴԻԿԱ ՀԱՐՑԱԹԵՐԹԻԿ ԿԱՆԽԱՏԵՍՈՒՄ",
    "description": "Ստացված թիվը համապատասխանում է որպես անկեղծության սանդ¬ղակի բալերի քա¬նակ: Եթե հետազոտվողի մոտ նշվում է 10 բալից շատ, ապա ստաց¬ված տվյալներով վեր¬լու¬ծություն կատարել խորհուրդ չի տրվում և պետք է անազնվու¬թյան պատճառները պարզել զրույցի միջոցով: \n" +
        "Նյարդահոգեկան կայունության սանդղակի ցուցանիշները ստանում ենք պատասխանների պլյուսների և մինուսների համընկած քանակի ամփոփմամբ (միավորների գումարով):",
    "instructions": "Առաջարկվող պնդումները վերաբերում են Ձեր առողջությանը և բնավորությանը: Եթե համաձայն եք ընտրեք ԱՅՈ-ն, եթե համաձայն չեք ընտրեք ՈՉ-ը" +
        "Պատասխանների վրա աշխատեք շատ չմտածել, քանի որ ճիշտ կամ սխալ պատասխաններ չկան:",
    "keys": [
        {
            "id": Math.random(),
            "range": [5, 6],
            "comment": "Բարենպաստ",
            "conclusion": "բարձր նյարդահոգեկան կայունություն"
        },
        {
            "id": Math.random(),
            "range": [7, 13],
            "comment": "Բարենպաստ",
            "conclusion": "լավ նյարդահոգեկան կայունություն"
        },
        {
            "id": Math.random(),
            "range": [14, 22],
            "comment": "Բարենպաստ",
            "conclusion": "բավարար ՆՀԿ"
        },
        {
            "id": Math.random(),
            "range": [23, 28],
            "comment": "Երկիմաստ (ոչ միանշանակ) ԿԱՆԽԱՏԵՍՈՒՄ",
            "conclusion": "բավարար ՆՀԿ"
        },
        {
            "id": Math.random(),
            "range": [29, 33],
            "comment": "Անբարենպաստ",
            "conclusion": "անբավարար ՆՀԿ"
        }
    ],
    "questions": [
        {
            "id": Math.random(),
            "question": "",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ԱՅՈ",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ՈՉ",
                    "point": 3
                }
            ]
        }
    ]
};
