const data = {
    "id": Math.random(),
    "title": "***ԱՐԴՅՈՔ ԼԱՎԱՏԵՍ Ե՞Ք",
    "description": "Անհրաժեշտ է ընտրել հնրավոր տարբերակներից միայն մեկը:",
    "instructions": "",
    "keys": [
        {
            "id": Math.random(),
            "range": [24, 35],
            "comment": "",
            "conclusion": "Դուք անվիճելի հոռետես եք, դուք պետք է ինչ-որ բան փոխեք:"
        },
        {
            "id": Math.random(),
            "range": [36, 47],
            "comment": "",
            "conclusion": "Ժամանակ առ ժամանակ ձեզ մոտ լավատեսական մտքեր առաջանում են, բայց հոռետեսությունը գերակայում է: Փորձեք ինչ-որ հաճելի բան անել ինքներդ ձեզ համար:"
        },
        {
            "id": Math.random(),
            "range": [48, 60],
            "comment": "",
            "conclusion": "Ընդհանուր առմամբ ձեր հայացքները բավականին առողջ են, բայց դուք չեք կարողանում հրաժարվել հոռետեսական տրամադրություններից:"
        },
        {
            "id": Math.random(),
            "range": [61, 75],
            "comment": "",
            "conclusion": "Կյանքի նկատմամբ ձեր հայացքները իրական են, հստակ, ցանկացած իրադրության մեջ դուք պահպանում եք լավատեսությունը:"
        },
        {
            "id": Math.random(),
            "range": [76, 90],
            "comment": "Անբարենպաստ",
            "conclusion": "Դուք ծնված օրվանից լավատես եք և դուք ճիշտ եք: Բայց այդ հատկությունը խանգարում է ձեզ ուղղել ձեր սխալները:"
        },
        {
            "id": Math.random(),
            "range": [91, 100],
            "comment": "Անբարենպաստ",
            "conclusion": "Սա արդեն լավատեսություն չէ, այլ թեթևամտություն, դուք ընդհանրապես չեք ճանաչում մարդկանց, աշխարհը և չեք էլ փորձում:"
        }
    ],
    "questions": [
        {
            "id": Math.random(),
            "question": "Ձեր երազները`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "դրամատիկ են (սարսափելի)",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "մշուշոտ",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "հաճելի",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "էրոտիկ",
                    "point": 5
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Առավոտյան արթնանալիս ինչի մասին եք մտածում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ինչպիսին կլինի եղանակը,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "աշխատանքի մասին, որը դուք սիրում եք",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "սիրած մարդու մասին",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "մարդու մասին, որը ձեզ տհաճ է:",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք սովորաբար ինչպես եք նախաճաշում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ժամանակ եք տրամադրում սեղանի պարագաները դասավորելու,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "նախաճաշելիս բողոքում եք, որ լավ չեք քնել,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "սիրում եք զրուցել,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": " շտապում եք, քանի որ հաճախ ուշանում եք:",
                    "point": 1
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Եթե դուք թերթ եք կարդում կամ լուրեր եք լսում, ապա ինչին եք ուշադրություն դարձնում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "քաղաքական և տնտեսական նորություններին,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "սպորտային նորություններին,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "մշակութային նորություններին,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "գեղեցիկ կանանց նկարներին:",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք ինչպես եք արձագանքում, երբ կարդում կամ լսում եք ինչ-որ հանցագործության, խայտառակ իրադարձության մասին`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ձեզ համար միևնույն է,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "անհանգստանում եք, որ հանկարծ նման բան ձեզ հետ չպատահի",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "զարմանում եք, որ իրավապահ մարմինները չեն կարողանում կարգ ու կանոն հաստատել,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "հասկանում եք, որ աշխարհում նման բաներ էլ են լինում",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Անծանոթ մարդու հետ առաջին անգամ հանդիպելիս ինչպես եք ձեզ պահում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "միանգամից վստահում եք նրան,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "սպասում եք, մինչև նա ձեզ ինչ-որ բան խնդրի",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "հետաքրքրությամբ զննում եք նրան,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "հետևում եք նրան, բայց ոչ մի ենթադրություն չեք անում:",
                    "point": 3
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Եթե դուք նկատում եք, որ ինչ-որ մեկը ձեզ վրա ուշադրություն է դարձնում (թատրոնում, փողոցում և այլուր), ի՞նչ եք անում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ձեզ թվում է, ձեր մեջ ինչ-որ բան կա,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "դա նույնիսկ ձեզ հաճելի է,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "նայում եք ձեզ հայելու մեջ,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ուշադրություն չեք դարձնում, ձեզ համար միևնույն է",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք անծանոթ քաղաքում ինչ-որ հասցե եք փնտրում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "նախընտրում եք տաքսի վարձել,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "հարցնում եք ծանոթներին,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "կփորձեք ինքներդ գտնել",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "կանհանգստանաք, որ չեք կարող գտնել",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինչպիսի մտքերով եք սկսում աշխատանքային օրը``",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "հույս ունեք, որ այն բարեհաջող կլինի,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "սպասում եք, որ աշխատանքային օրը արագ կանցնի",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "աշխատավայրում ձեզ հաճելի է տեսնվել, զրուցել կոլեգաների հետ",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "դուք հույս ունեք, որ այդ օրը անհաջողություններ, խնդիրներ չեն հանդիպի",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք ինչ-որ խաղում պարտվում եք`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ընկնում է ձեր տրամադրությունը, հավանաբար դա ձեր օրը չէր,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "շարունակում եք խաղալ, մինչև հաղթեք,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "մտածում եք, որ դա ընդամենը խաղ է, և ինչ-որ մեկը պիտի հաղթի, իսկ ինչու ոչ դուք,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "փորձում եք հաղթելու միջոց գտնել:",
                    "point": 3
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Երբ ձեզ մատուցում են ոչ մեծ չափաբաժնով շատ համեստ ուտեստ`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ախորժակով վրա եք պրծնում,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ կարող եք գիրանալ,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ուտում եք խղճի խայթ զգալով",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ ձեր ստամոքսը չի մարսի",
                    "point": 1
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Եթե դուք վիճում եք ինչ-որ մեկի հետ, որին համակրում եք`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ վերջնական կարող եք կապը կտրել նրա հետ,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "հանգիստ եք տանում, քանի որ դրանում իմաստ եք գտնում,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "կարծում եք, որ հավանաբար դուք շուտ կհաշտվեք և ամեն ինչ կկարգավորվի,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "չափազանց «հարթ» հարաբերությունները տխուր են",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Եթե լոգասենյակում նայում եք ձեր կազմվածքին`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ընդհանուր առմամբ տպավորությունը լավ է, չնայած, որ կատարելությունը սահմաններ չունի,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "հարկավոր է նիհարել, բայց դրա համար պետք է չարչարվել,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ոչինչ առանձնահատուկ չեք տեսնում ձեր կառուցվածքում,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "միանգամից որոշում եք, որ մարմնամարզությամբ է պետք զբաղվել:",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինչպիսին եք դուք սիրո մեջ`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ես ամբողջովին տրվում եմ անգամ կարճ ժամանակում,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "բուռն կրքեր ունեմ, իսկ դրանք դիմացինին հաճելի են",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ինձ անընդհատ ինչ-որ մի բան անհանգստացնում է, ես չափազանց կաշկանդված եմ",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "ես ինձ լավ եմ զգում, ոչ մի բան ինձ չի անհանգստացնում",
                    "point": 5
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք անցել եք բուժ զննում և սպասում եք արդյունքներին`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ ձեր մոտ ինչ-որ լուրջ բան կարող են հայտնաբերել",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "գիտեք, որ բժիշկը, միևնույն է` ճշմարտությունը չի ասի",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "կարծում եք, որ անհանգստանալու պատճառ չկա, ինչո՞ւ պետք է վախենաք",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "կարծում եք, որ յուրաքանչյուրը պետք է ժամանակին իմանա ճշմարտությունը",
                    "point": 3
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ամեն օր շփվելով մարդկանց հետ ի՞նչ եք զգում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ջերմ եք կամ սառն եք ձեզ պահում` կախված հանգամանքներից,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "հաճախ ձեզ անհարմար եք զգում, քանի որ չգիտեք ինչպես ձեզ պահել անծանոթ մարդկանց հետ շփվելիս,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ուշադիր եք, թե ինչ կասեն ձեր վարքի մասին ուրիշները",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "հաճախ ձեզ թվում է, որ դուք բարձր եք ուրիշներից",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք մեկնում եք երկարատև ճամփորդության: Ինչպե՞ս եք պատրաստվում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "մանրամասն պլանավորում եք,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "չեք կասկածում, որ ինչ-որ շեղում անպայման կլինի,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "ամեն ինչ կկարգավորվի, հատուկ չեք պատրաստվում,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "մինչև մեկնելը գտնվում եք լարված վիճակում",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Թվարկված գույներից, որին եք առավել նախապատվություն տալիս`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "կարմիր",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "մոխրագույն",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "կանաչ",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "կապույտ",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Երբ դուք որոշում եք կայացնում, ինչի՞ վրա եք հույսներդ դնում`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ամեն ինչ կախված է նրանից, որ ձեր բախտը կբերի և հաջողությունը կուղեկցի ձեզ,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ինքներդ ձեզ վրա",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "դուք ի վիճակի եք օբյեկտիվորեն գնահատել ձեր հնարավորությունները,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "ուշադրություն եք դարձնում «սև կատուն ճանապարհս չկտրի», և այլ նման բաների վրա,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "ամեն մեկն իր բախտն ունի:",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք ունեք ընտրելու հնարավորություն`",
            "type": "single",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ստանալ ոչ մեծ ժառանգություն,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "ունենալ կայուն հաջողություններ մասնագիտական ասպարեզում,",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "գիտության, արվեստի ոլորտում ինչ-որ նշանակալից բաներ ստեղծել,",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "հանդիպել իսկական սիրո, ծանոթանալ լավ ընկերոջ հետ",
                    "point": 4
                },

            ]
        }
    ]
};
