const data = {
    "id": Math.random(),
    "title": "ԿՈՆՖԼԻԿՏԱՅՆՈՒԹՅԱՆ ԱՍՏԻՃԱՆԸ ՈՐՈՇՈՂ ԹԵՍՏ",
    "description": "",
    "instructions": "Պատասխանների 3 հնարավոր տարբերակներից ընտրեք միայն մեկը` առավել ձեզ հարմարը:",
    "keys": [
        {
            "id": Math.random(),
            "range": [10, 14],
            "comment": "",
            "conclusion": "Դուք առիթ եք փնտրում վիճելու, որն ավելորդ է: Սիրում եք քննադատել, նաև այն ժամանակ, երբ դա ձեզ օգուտ է: Դուք փաթաթում եք ձեր կարծիքը, եթե անգամ սխալ եք: Չեք նեղանա, եթե ձեզ կոնֆլիկտային անվանեն: Մտածեք, արդյոք չեք տառապում թերարժեքության բարդույթով:"
        },
        {
            "id": Math.random(),
            "range": [15, 29],
            "comment": "",
            "conclusion": "Ձեր մասին ասում են, որ դուք կոնֆլիկտային անձնավորություն եք: Դուք համառորեն պնդում եք ձեր կարծիքը, հաշվի չառնելով, թե այն ինչպես կանդրադառնա անձնական և ծառայողական հարաբերությունների վրա: Դրա համար էլ ձեզ հարգում են:"
        },
        {
            "id": Math.random(),
            "range": [30, 40],
            "comment": "",
            "conclusion": "Դուք տակտով եք, չեք սիրում կոնֆլիկտներ, հեշտությամբ խուսափում եք դրանցից: Երբ վեճի եք բռնվում, հաշվի եք առնում, թե ինչպես դա կանդրադառնա ծառայողական կամ ընկերական հարաբերությունների վրա: Դուք ձգտում եք շրջապատի համար լինել հաճելի, բայց երբ օգնության կարիք է զգացվում, դուք միշտ չէ, որ որոշում եք օգնել, ինչի պատճառով էլ կորցնում եք հարգանքը:"
        }
    ],
    "questions": [
        {
            "id": Math.random(),
            "question": "Պատկերացրեք, որ հասարակական տրանսպորտում վեճ է սկսվում: Ինչպես կվարվեք.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ա. կխուսափեք վեճի մեջ խառնվել",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "բ. կարող եք խառնվել, կանգնել տուժողի կողքին, որը ճիշտ է,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "գ. միշտ խառնվում եք և մինչև վերջ պահում եք ձեր տեսակետը:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ժողովի ժամանակ դուք քննադատում եք ղեկավարությանը թույլ տված սխալների համար` ",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ա. ոչ,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "բ. այո, բայց կախված ղեկավարության նկատմամբ իմ անձնական վերաբերմունքից,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "գ. միշտ քննադատում եք սխալների համար:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ձեր անմիջական ղեկավարը ներկայացնում է աշխատանքի իր ծրագիրը, որը ձեզ թվում է անիրական: Կառաջարկեք ձեր ծրագիրը, որն ըստ ձեզ ավելի լավն է`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ա. եթե ուրիշները ձեզ առաջարկեն` այո,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "հավանաբար դուք կառաջարկեք ձեր ծրագիրը,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ քննադատության համար ձեզ կզրկեն դրամական պարգևից:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք սիրում եք վիճել ձեր ընկերների, կոլեգաների հետ`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "միայն նրանց հետ ովքեր չեն վիրավորվում և երբ վեճերը չեն փչացնում հարաբերությունները,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "այո, բայց միայն սկզբունքային, կարևոր հարցերի շուրջ,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "դուք վիճում եք բոլորի հետ և ցանկացած առիթով:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինր-որ մեկը փորձում է հերթի մեջ ձեզանից առաջ անցնել`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "մտածելով, որ դուք իրենից վատը չեք, կփորձեք շրջանցել հերթը,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "զարմանում եք,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "բացեիբաց արտահայտում եք ձեր դժգոհությունը:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Պատկերացրեք, որ դուք նայում եք ձեր գործընկերոջ փորձարարական աշխատանքները, որտեղ կան նոր գաղափարներ, բայց կան նաև սխալներ: Դուք գիտեք, որ ձեր կարծիքը լինելու է վճռորոշ: Ինչպես կվարվեք`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "կնշեք աշխատանքի և դրական, և բացասական կողմերը,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "կնշեք աշխատանքի դրական կողմերը և կառաջարկեք շարունակել աշխատանաքը,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "կքննադատեք` նշելով, որ նորարարը չպետք է սխալվի:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Պատկերացրեք, որ ձեր կինը մշտապես Ձեզ հիշեցնում է գումարը տնտեսելու մասին, իսկ ինքը թանկարժեք իրեր է գնում: Նա ուզում է իմանալ ձեր կարծիքն իր վերջին գնումների մասին: Ինչպե՞ս կվարվեք:",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "գովաբանում եք նրան,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "ասում եք, որ ավելորդ գնումներ է կատարել,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "անընդհատ վիճում եք կատարած գնումների համար:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք հանդիպել եք դեռահասների, որոնք ծիծաղում են: Ինչպես կարձագանքեք`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "մտածում եք` «Ուրիշի անդաստիարակ երեխաների համար ինչի փչացնեմ տրամադրությունս»,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "դիտողություն եք անում նրանց,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "եթե դա լիներ հասարակական վայրում, դուք նրանց հաշիվները կմաքրեիք:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ռեստորանում դուք նկատում եք, որ մատուցողը հաշվի մեջ խաբել է ձեզ`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "այդ դեպքում դուք նրան ավել գումար չեք թողնում, որը նախօրոք պատրաստել էիք,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "կխնդրեք, որ վերահաշվարկի,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "կվիճեք:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք գտնվում եք հանգստի տանը, որտեղ ադմինիստրատորը զբաղված է կողմնակի գործերով և չի հետևում սենյակի մաքրությանը, դուք`",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "եթե անգամ արտահայտեք ձեր դժգոհությունը, դժվար թե ինչ-որ բան փոխվի,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "միջոց կգտնեք բողոքելու, թող նրան անգամ հեռացնեն աշխատանքից կամ պատժի ենթարկեն,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ձեր դժգոհությունը ուղղում եք մատուցողներին, հավաքարարներին:",
                    "point": 0
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Դուք վիճում եք ձեր դեռահաս տղայի հետ և համոզվում եք, որ սխալ եք:",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ոչ,",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "բնականաբար կընդունեմ,",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "ինչ հեղինակություն կունենամ, եթե ընդունեմ որ սխալ եմ:",
                    "point": 0
                }
            ]
        }
    ]
};
