const data = {
    "id": Math.random(),
    "title": "ԱՆՁԻ ԱԳՐԵՍԻՎՈՒԹՅԱՆ ՈՒՍՈՒՄՆԱՍԻՐՄԱՆ ՄԵԹՈԴԻԿԱ ԸՍՏ «ԲԱՍՍ-ՊԵՐԻԻ»",
    "description": "",
    "instructions": "Կարդացե’ք այս պնդումները և որոշե’ք թե ինչքանով են դրանք համա¬պա¬տաս¬խանում Ձեր հիմնական վարվելաձևին, Ձեր կերպարին, և պատասխանեք հնարավոր պա¬տա¬սխաններից մեկով: Ձեր ընտրած տարբերակը ընդգծեք: Երկար մի խորհեք, ընտրեք պա¬տաս¬խանի այն տարբերակը, որն առաջինը կգա Ձեր մտքին: Այստեղ չկան ճիշտ կամ սխալ, լավ կամ վատ տարբերակներ: Պատասխանեք` ոչինչ բաց չթողնելով:",
    "keys": [
        {
            "id": Math.random(),
            "range": [0, 12],
            "comment": "",
            "conclusion": " "
        },
        {
            "id": Math.random(),
            "range": [13, 24],
            "comment": ""
        },
        {
            "id": Math.random(),
            "range": [],
            "comment": ""
        }
    ],
    "questions": [
        {
            "id": Math.random(),
            "question": "",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "",
                    "point": 3
                }
            ]
        }
    ]
};
