const data = {
    "id": Math.random(),
    "title": "ԿԵՆՍԱԿԱՆ ԲԱՐԴ ԻՐԱԴՐՈՒԹՅՈՒՆԻՑ ԴՈՒՐՍ ԳԱԼՈՒ ԿԱՐՈՂՈՒԹՅՈՒՆՆ ՍՏՈՒԳՈՂ ՄԵԹՈԴԻԿԱ",
    "description": "",
    "instructions": "Ընտրե'ք առաջարկվող պատասխանների տարբերակներից մեկը:",
    "keys": [
        {
            "id": Math.random(),
            "range": [7, 15],
            "comment": "",
            "conclusion": "տվյալ անձը հեշտ է համակերպվում անախորժությունների` ճիշտ գնահատելով կատարվածը և պահպանելով հոգեկան հավասարակշռությունը:"
        },
        {
            "id": Math.random(),
            "range": [16, 20],
            "comment": "",
            "conclusion": "տվյալ մարդը միշտ չէ, որ արժանապատվորեն է դիմա-կայում ճակատագրի հարվածներին. Նա հաճախ բորբոքվում է, պրոբլեմների առկայության դեպքում հուսահատվում, անիծում դրանք և հույսը դնում ուրիշի վրա:"
        },
        {
            "id": Math.random(),
            "range": [20,36],
            "comment": "",
            "conclusion": "տվյալ անձը չի կարող նորմալ տանել անհաջողությունը և դրանից հաճախ ոչ ադեկվատ է պահում:"
        }
    ],
    "questions": [
        {
            "id": Math.random(),
            "question": "Արդյոք ուրիշ մարդկանց պատմու՞մ եք ձեր պրոբլեմների և անհաջողությունների մասին.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ոչ, քանի որ, իմ կարծիքով, դա գործին չի օգնի,",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "այո, եթե դրա համար կա հարմար զրուցակից, ",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "ոչ միշտ, քանի որ հաճախ դրա մասին մտածելն անգամ տհաճ է, էլ ուր մնաց պատմելը:",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ծա՞նր եք տանում արդյոք անհաջողությունը.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "միշտ և շատ ծանր",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "կախված է հանգամանքներից",
                    "point": 0
                },
                {
                    "id": Math.random(),
                    "answer": "աշխատում եմ համակերպվել, քանի որ համարում եմ, որ ցանկացած անհաջողությանը, վերջ է գալու:",
                    "point": 2
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Եթե դուք չեք օգտագործում ծխախոտ, ոգելից խմիչքներ, անցեք հաջորդ հարցին: Իսկ եթե օգտագործում եք, ապա ի՞նչ պատճառով.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "որպեսզի իմ հոգսերը խեղդեմ ծխի, կամ գինու մեջ",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "որպեսզի ինչ որ չափով մոռացության տամ պրոբլեմներս",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "հենց այնպես, ուղղակի ինձ դուր է գալիս ժամանակ առ ժամանակ ինձ ազատ զգալ ու լինել բարձր տրամադրության մեջ:",
                    "point": 1
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինչպե՞ս եք դուք վարվում, եթե ինչ-որ մի բան ձեզ խորապես ցավ է պատճառում.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ինձ թույլ եմ տալիս անել այն, ինչ վաղուց չեմ արել, և այդպես թուլացնել լարվածությունս",
                    "point": 0
                },
                {
                    "id": Math.random(),
                    "answer": "հյուր եմ գնում ընկերներիս",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "նստում եմ տանը և խղճում ինքս ինձ",
                    "point": 4
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Երբ մտերիմ մարդը վիրավորում է ձեզ, ապա դուք.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ամփոփվում եք ինքներդ ձեր մեջ և ոչ մեկի հետ չեք շփվում",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "նրանից բացատրություն եք պահանջում",
                    "point": 0
                },
                {
                    "id": Math.random(),
                    "answer": "այդ մասին պատմում եք բոլոր նրանց, ովքեր պատրաստ են ձեզ լսելու",
                    "point": 1
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Երջանկության պահին դուք.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "չեք մտածում կրած դժբախտության մասին",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "վախենում եք, որ այդ պահը արագ կանցնի",
                    "point": 3
                },
                {
                    "id": Math.random(),
                    "answer": "չեք մոռանում, որ կյանքը լի է տհաճություններով:",
                    "point": 5
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինչ կարծիք ունեք հոգեբանների մասին.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "ես կցանկանայի դառնալ նրանց այցելուն",
                    "point": 4
                },
                {
                    "id": Math.random(),
                    "answer": "շատերին նրանք իսկապես կարող են օգնել",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "մարդն ինքն է իր հոգեբանը",
                    "point": 3
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ճակատագիրն ըստ ձեզ.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "Ձեզ հետապնդում ",
                    "point": 5
                },
                {
                    "id": Math.random(),
                    "answer": "անարդար է Ձեր հանդեպ",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "Ձեր հանդեպ բարեհաճ է",
                    "point": 1
                }
            ]
        },
        {
            "id": Math.random(),
            "question": "Ինչի մասին եք դուք մտածում, սիրելի անձնավորության հետ վիճելուց հետո, երբ զայրույթն արդեն անցել է.",
            "type": "",
            "answers": [
                {
                    "id": Math.random(),
                    "answer": "այն հաճելիի մասին, որ եղել է ձեր երկուսի միջև անցյալում",
                    "point": 1
                },
                {
                    "id": Math.random(),
                    "answer": "Ցանկանում եք գաղտնի նրանից վրեժ լուծել",
                    "point": 2
                },
                {
                    "id": Math.random(),
                    "answer": "մտածում եք այն մասին, թե ինչքան եք ստիպված եղել հանդուրժել նրան",
                    "point": 3
                }
            ]
        }
    ]
};
